In [1]:
import pandas as pd
import numpy as np

In [2]:
#CREATING A DICTIONARY AS AN ALTERNATE TO THE REAL DATA
people={
    "first":["","salma","mahy","passant",np.nan,None,"NA"],
    "last":["kamal","diab","aboalsadat","shawky",np.nan,np.nan,"56"],
    "age":["33","34","44","55",None,"56","missing"]
}

In [3]:
#WANT TO PUT THIS DICTIONARY IN THE DATA FRAME 
df=pd.DataFrame(people)
df

     first        last      age
0                kamal       33
1    salma        diab       34
2     mahy  aboalsadat       44
3  passant      shawky       55
4      NaN         NaN     None
5     None         NaN       56
6       NA          56  missing

In [4]:
df = df.replace('', np.nan)

In [6]:
df.isna()
df.isna().sum()

first    3
last     2
age      1
dtype: int64

In [ ]:
df.dropna(axis="index",how="any",subset=["age"])
df

In [ ]:
#Dropping the non customized nan values 
df.dropna()
df

In [30]:
#Dropping 3ady ay haga bs el age la2 
df.dropna(axis="index",how="any",subset=["age"])

     first        last      age
0                kamal       33
1    salma        diab       34
2     mahy  aboalsadat       44
3  passant      shawky       55
5     None         NaN       56
6       NA          56  missing

In [31]:
df.dropna(axis="index",how="any",subset=["age","first"])

     first        last      age
0                kamal       33
1    salma        diab       34
2     mahy  aboalsadat       44
3  passant      shawky       55
6       NA          56  missing

In [32]:
df.replace("missing",np.nan,inplace=True)
df.replace("NA",np.nan,inplace=True)

In [33]:
df.dropna(axis="index",how="any",subset=["age","last"])

     first        last age
0                kamal  33
1    salma        diab  34
2     mahy  aboalsadat  44
3  passant      shawky  55

In [34]:
df.isna()

   first   last    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4   True   True   True
5   True   True  False
6   True  False   True

In [35]:
# fill na with 0 is good in numerical data
df.fillna(0)

     first        last age
0                kamal  33
1    salma        diab  34
2     mahy  aboalsadat  44
3  passant      shawky  55
4        0           0   0
5        0           0  56
6        0          56   0

In [36]:
# In the numerical columns u wonna get the mean std you will not be able to get it as data types are string not int
df.dtypes

first    object
last     object
age      object
dtype: object

In [37]:
type(np.nan)
# so if we tried to convert the cols to int will throw an error as nan values are float and can not be converted

float

In [38]:
df["age"]=df["age"].astype(float)

In [39]:
df.dtypes

first     object
last      object
age      float64
dtype: object

In [40]:
df["age"].mean()

44.4

In [41]:
#Printing the head
df.head()

     first        last   age
0                kamal  33.0
1    salma        diab  34.0
2     mahy  aboalsadat  44.0
3  passant      shawky  55.0
4      NaN         NaN   NaN

In [42]:
df.isna().sum()

first    3
last     2
age      2
dtype: int64

In [43]:
df["first"].isna().sum()

3

In [44]:
df["age"][0]

33.0

In [45]:
for i in range(len(df)):
    if df["age"][i]<=40:
        df.drop([i],axis=0,inplace=True)

In [46]:
df

     first        last   age
2     mahy  aboalsadat  44.0
3  passant      shawky  55.0
4      NaN         NaN   NaN
5     None         NaN  56.0
6      NaN          56   NaN

In [47]:
df["age"]=df["age"][6].astype(float)

In [48]:
df["age"].mean()

nan

In [49]:
df[df['first'] == ''].index

Int64Index([], dtype='int64')

In [50]:
df = df.replace('', np.nan)

In [51]:
df

     first        last  age
2     mahy  aboalsadat  NaN
3  passant      shawky  NaN
4      NaN         NaN  NaN
5     None         NaN  NaN
6      NaN          56  NaN